Xception(
  (conv1): Conv2d(3, 32, kernel_size=(3, 3), stride=(2, 2), bias=False)
  (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (relu): ReLU(inplace=True)
  (conv2): Conv2d(32, 64, kernel_size=(3, 3), stride=(1, 1), bias=False)
  (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (block1): Block(
    (skip): Conv2d(64, 128, kernel_size=(1, 1), stride=(2, 2), bias=False)
    (skipbn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): SeparableConv2d(
        (conv1): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=64, bias=False)
        (pointwise): Conv2d(64, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (2): ReLU(inplace=True)
      (3): SeparableConv2d(
        (conv1): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=128, bias=False)
        (pointwise): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (4): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (5): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    )
  )
  (block2): Block(
    (skip): Conv2d(128, 256, kernel_size=(1, 1), stride=(2, 2), bias=False)
    (skipbn): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=128, bias=False)
        (pointwise): Conv2d(128, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=256, bias=False)
        (pointwise): Conv2d(256, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    )
  )
  (block3): Block(
    (skip): Conv2d(256, 728, kernel_size=(1, 1), stride=(2, 2), bias=False)
    (skipbn): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=256, bias=False)
        (pointwise): Conv2d(256, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    )
  )
  (block4): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block5): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block6): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block7): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block8): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block9): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block10): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block11): Block(
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): ReLU(inplace=True)
      (7): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (8): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (block12): Block(
    (skip): Conv2d(728, 1024, kernel_size=(1, 1), stride=(2, 2), bias=False)
    (skipbn): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu): ReLU(inplace=True)
    (rep): Sequential(
      (0): ReLU()
      (1): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 728, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (2): BatchNorm2d(728, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (3): ReLU(inplace=True)
      (4): SeparableConv2d(
        (conv1): Conv2d(728, 728, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=728, bias=False)
        (pointwise): Conv2d(728, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
      )
      (5): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (6): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    )
  )
  (conv3): SeparableConv2d(
    (conv1): Conv2d(1024, 1024, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=1024, bias=False)
    (pointwise): Conv2d(1024, 1536, kernel_size=(1, 1), stride=(1, 1), bias=False)
  )
  (bn3): BatchNorm2d(1536, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (conv4): SeparableConv2d(
    (conv1): Conv2d(1536, 1536, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=1536, bias=False)
    (pointwise): Conv2d(1536, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
  )
  (bn4): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (last_linear): Linear(in_features=2048, out_features=4, bias=True)
)
Epoch: 1/40
Epoch: 001, Training: Loss: -406.3216, Accuracy: 52.5107%, 
		Validation: Loss: -406.3216, Accuracy: 55.7692%, Time: 7159.5627s
Best Accuracy for validation : 0.5577 at epoch 001
[10808, 1287, 8945, 10804, 5755, 35, 3545, 3949, 117, 689, 8733, 5628, 1250, 3643, 8056, 5753, 6243, 5163, 9345, 841, 10242, 7772, 2713, 10554, 8055, 9745, 9232, 4535, 3389, 557, 1308, 8849, 7844, 3843, 10142, 7170, 6630, 9365, 2177, 5679, 8708, 7710, 3399, 10676, 8365, 5926, 8788, 8720, 6087, 298, 11101, 1069, 3968, 802, 9386, 3544, 9753, 2683, 5387, 10354, 957, 5928, 7, 1233, 5671, 9677, 8044, 4336, 7774, 10467, 5640, 9376, 1050, 5918, 3965, 7323, 142, 5072, 4479, 9600, 10800, 9484, 10076, 9738, 8398, 10370, 2535, 987, 8050, 984, 2144, 3229, 9294, 8401, 4876, 5005, 8519, 4873, 789, 8750, 9706, 8711, 1632, 8352, 9751, 8984, 2576, 3938, 3637, 9350, 2848, 8754, 10368, 8403, 10820, 5957, 6467, 9231, 1378, 6085, 692, 9223, 523, 3976, 10944, 5630, 3973, 100, 9196, 3004, 9056, 9354, 102, 10137, 5158, 2581, 3906, 1765, 849, 3408, 152, 9348, 3796, 8651, 8435, 5673, 1830, 4495, 1257, 11219, 11330, 5417, 3454, 5546, 972, 809, 9280, 4870, 8993, 3387, 7832, 1385, 0, 9755, 1049, 985, 5953, 2, 4474, 3995, 3632, 4430, 9236, 2528, 9730, 5634, 10074, 749, 9371, 1769, 3799, 3994, 3540, 10140, 8395, 108, 551, 5279, 10945, 3959, 8313, 1054, 97, 8974, 10, 977, 788, 1834, 4337, 8396, 6693, 8987, 1251, 9759, 3815, 5743, 11105, 3542, 528, 10246, 988, 5909, 5622, 9352, 4468, 1314, 5678, 8049, 5950, 4529, 5638, 7864, 8060, 10249, 10065, 3897, 9762, 10831, 4306, 5624, 10790, 8058, 526, 8314, 1238, 5610, 9373, 1321, 23, 10950, 9674, 8785, 2851, 2530, 210, 5012, 5075, 8083, 9289, 4491, 2574, 5695, 1831, 3979, 3418, 804, 1307, 8369, 7574, 9392, 135, 10351, 3864, 2525, 9384, 5164, 4432, 7865, 1068, 4084, 3872, 8624, 2688, 8655, 9347, 8362, 842, 9328, 297, 7705, 9327, 8456, 8441, 9777, 7851, 3655, 8515, 2312, 7008, 3869, 8729, 9344, 7838, 8719, 11324, 8356, 1259, 1045, 3636, 1064, 5548, 10545, 4199, 3902, 6688, 9233, 8450, 10556, 4528, 3803, 9705, 11327, 1771, 10811, 2908, 5751, 7005, 9781, 9283, 8038, 9364, 793, 8451, 5930, 5908, 9227, 1290, 11323, 837, 8654, 9342, 8712, 5006, 3656, 10562, 10817, 1241, 4736, 5733, 5611, 9241, 1610, 10408, 9657, 4871, 8709, 1919, 4466, 3950, 1096, 6464, 3912, 5617, 10679, 215, 9055, 6783, 2914, 5616, 7036, 959, 3930, 7858, 9666, 9670, 10468, 1075, 2715, 141, 10678, 10247, 94, 9757, 9776, 9281, 3879, 9341, 4428, 6463, 2533, 1056, 5411, 1300, 3874, 7831, 3538, 3412, 6155, 9599, 4499, 9681, 211, 3794, 8350, 2531, 3854, 5276, 2579, 7855, 5699, 3120, 975, 6088, 4231, 8367, 4422, 9375, 8991, 843, 10064, 6465, 8986, 3628, 5635, 8110, 28, 5009, 112, 2546, 2036, 3627, 9381, 5621, 9598, 137, 2310, 4078, 2913, 8627, 5159, 105, 986, 3981, 10358, 1048, 3657, 5278, 8744, 9480, 11007, 801, 7434, 1234, 10823, 8622, 10371, 10139, 8459, 3791, 4487, 11097, 95, 1382, 5696, 4842, 4446, 8114, 3961, 7570, 10821, 1310, 3984, 9377, 3121, 3419, 90, 8746, 552, 1230, 6086, 9225, 3894, 8790, 10019, 9239, 11222, 8789, 9385, 5912, 2540, 7709, 4423, 9351, 2172, 2149, 9394, 960, 5821, 2042, 7228, 9678, 7860, 9061, 9278, 748, 8045, 6896, 5681, 8751, 11099, 11008, 7572, 123, 7321, 4413, 1073, 8652, 9662, 150, 530, 9234, 8355, 9220, 1923, 144, 4872, 10407, 5627, 416, 3931, 9190, 1631, 3927, 4742, 4233, 9355, 11, 10067, 8444, 4494, 4467, 11009, 21, 969, 2375, 10361, 5639, 3400, 7848, 8364, 414, 5700, 4197, 7770, 6092, 2529, 2541, 4850, 8983, 3970, 4247, 3923, 4239, 11326, 981, 9191, 4450, 10947, 8628, 3249, 1248, 4244, 9928, 3924, 10784, 2543, 1093, 8347, 3954, 7849, 839, 3224, 9057, 8399, 3846, 5914, 3875, 5550, 3896, 5759, 3654, 11012, 8847, 8716, 10558, 3971, 3905, 9275, 3635, 1313, 8043, 33, 4077, 4623, 4235, 4739, 10681, 8449, 8309, 5687, 9680, 8999, 4530, 2146, 10248, 5752, 8346, 555, 2999, 3990, 844, 785, 1635, 5749, 9870, 12, 9274, 1764, 26, 10812, 3256, 799, 2522, 10275, 9734, 3925, 7977, 4234, 4242, 6147, 7840, 3867, 9708, 4256, 5690, 8117, 8518, 2537, 1304, 4449, 3868, 10540, 847, 8375, 3929, 9868, 10531, 8349, 2308, 9724, 8623, 5545, 3787, 10066, 527, 3901, 7853, 2997, 8371, 1236, 3814, 1231, 8723, 7319, 6470, 1502, 3967, 1917, 5614, 1383, 132, 8784, 4843, 3850, 11104, 2714, 151, 854, 10815, 2367, 4436, 6900, 8454, 806, 3650, 4454, 7981, 10826, 4741, 9393, 8111, 4245, 869, 4253, 3947, 1833, 3955, 3409, 27, 3945, 1254, 5552, 3895, 786, 8357, 6690, 10245, 965, 8048, 9671, 4469, 10787, 794, 9329, 9597, 3878, 4534, 115, 751, 3865, 10813, 9865, 7235, 3661, 2306, 8084, 5924, 3849, 5162, 3934, 4531, 4490, 11103, 10551, 4307, 8380, 6148, 10816, 9741, 3453, 5160, 10375, 10783, 9929, 8307, 3784, 4485, 961, 982, 10411, 4480, 5691, 5932, 98, 3115, 9720, 1289, 3887, 1828, 1079, 7546, 2142, 9930, 10559, 5819, 1829, 8348, 9703, 4471, 5935, 6624, 8855, 3769, 9226, 10363, 4463, 6150, 8703, 6695, 300, 6361, 1498, 4488, 2461, 10372, 10271, 1063, 5956, 3962, 3388, 8385, 5389, 10785, 4414, 8115, 9335, 11328, 3853, 973, 8630, 8112, 7768, 3398, 9295, 4079, 8938, 7437, 8244, 8061, 7547, 8372, 9219, 9362, 1603, 5703, 6898, 1608, 10364, 7234, 420, 7227, 5734, 1636, 798, 4497, 7320, 2998, 7846, 5073, 9193, 5737, 9356, 2524, 6901, 3390, 3651, 4246, 4439, 8378, 5416, 10814, 5067, 845, 8734, 9391, 6154, 9058, 1303, 10802, 3789, 9754, 5, 9482, 4484, 8514, 1055, 5384, 6628, 8404, 10471, 2038, 8990, 114, 10535, 1070, 11214, 3790, 5412, 9739, 750, 8311, 1291, 3413, 10053, 3658, 1311, 858, 3804, 7833, 11014, 8391, 5738, 9360, 5742, 805, 5927, 1767, 8738, 1606, 2147, 11013, 1296, 6781, 10054, 976, 6687, 3118, 4417, 10018, 2915, 5636, 3455, 4250, 3948, 209, 7029, 9380, 3989, 974, 9737, 7834, 755, 9372, 9731, 3223, 5748, 7167, 9279, 10474, 13, 1058, 10250, 10952, 3404, 5939, 7978, 8752, 8975, 5745, 4848, 9675, 3391, 9485, 7440, 3936, 5757, 3786, 8448, 3813, 2145, 9291, 1097, 4305, 8717, 2034, 34, 10355, 9729, 4877, 4303, 9343, 103, 4433, 7835, 3001, 4493, 1295, 687, 2575, 11010, 3005, 6, 10530, 11102, 8109, 979, 8113, 9726, 9060, 10017, 10544, 5674, 1072, 7847, 3893, 8392, 6689, 747, 8980, 303, 9368, 3993, 783, 800, 11221, 955, 3986, 840, 3764, 8741, 9761, 5161, 7982, 1060, 6241, 6153, 3859, 8942, 10274, 9395, 4304, 6237, 1059, 9748, 8848, 8054, 10475, 4734, 10555, 10075, 4849, 9864, 7830, 3917, 4421, 8360, 2844, 3880, 1309, 4420, 1249, 2176, 3812, 4869, 5693, 96, 4442, 10680, 5747, 10356, 4412, 8252, 5007, 10549, 7231, 4200, 867, 1066, 5633, 8062, 5551, 3944, 10472, 5011, 5814, 1061, 8358, 8063, 8088, 5736, 3806, 10277, 9293, 1225, 2174, 3649, 2305, 4456, 9370, 138, 9062, 4331, 11098, 4875, 3395, 2460, 3000, 4619, 8944, 4458, 1246, 870, 6466, 7842, 684, 7166, 529, 5910, 5544, 3873, 2037, 2682, 6356, 3928, 852, 863, 4201, 2464, 6469, 10360, 3920, 10412, 2532, 9339, 10273, 10951, 8973, 3808, 8626, 8085, 3886, 419, 5949, 3801, 4625, 8089, 8850, 1301, 5905, 1227, 5740, 8995, 302, 1, 4462, 3541, 3882, 3450, 5938, 2911, 10470, 4464, 6490, 3977, 5904, 3899, 9596, 3980, 3861, 9353, 299, 8248, 7769, 9723, 5615, 8979, 131, 2689, 2458, 11216, 7979, 7033, 3117, 3543, 8989, 9357, 10547, 4737, 8247, 1297, 3781, 9194, 20, 9766, 3952, 872, 1067, 8405, 3908, 8732, 4461, 207, 8039, 8053, 422, 6245, 9772, 3788, 6468, 8976, 3922, 5933, 10818, 10350, 8037, 8051, 9276, 7550, 10406, 5632, 7436, 9725, 989, 3782, 4874, 7318, 1053, 807, 7172, 6782, 5623, 522, 7707, 10057, 10564, 3876, 9218, 2369, 7322, 9733, 6491, 4081, 3253, 6354, 1243, 3941, 3933, 1501, 9349, 5817, 8116, 4483, 8791, 1052, 4476, 8786, 7171, 5952, 4232, 787, 3449, 4624, 5386, 5626, 4240, 2544, 5277, 3809, 10373, 9760, 9230, 9054, 10244, 5684, 3648, 212, 10270, 6495, 4735, 10078, 4441, 8718, 791, 1299, 10070, 9602, 10541, 3942, 7857, 10374, 3255, 9192, 3410, 3780, 8059, 797, 5913, 10809, 784, 2717, 7232, 3918, 3762, 4440, 6785, 9676, 3805, 7010, 8363, 1629, 3911, 9477, 3847, 525, 3857, 556, 10825, 2542, 857, 3904, 19, 3888, 4418, 853, 7767, 10949, 421, 109, 6629, 4237, 10546, 9284, 549, 8443, 1925, 107, 10532, 1319, 7859, 5758, 9361, 8994, 10079, 8939, 5697, 8434, 9478, 4486, 2169, 147, 9346, 2521, 8377, 10563, 10056, 3992, 10068, 9374, 9740, 3807, 10077, 4465, 8351, 5692, 970, 5609, 2463, 3910, 9331, 9763, 5547, 8457, 5815, 3939, 9935, 2910, 1237, 10061, 859, 9336, 3394, 3630, 855, 8748, 1071, 2538, 9290, 9330, 8388, 7168, 8436, 4447, 1922, 3884, 9756, 10058, 10272, 5672, 9767, 3401, 9332, 9288, 10536, 9673, 9324, 5074, 7771, 8978, 7773, 8437, 962, 8739, 8981, 2684, 754, 1768, 7704, 2578, 4451, 4473, 213, 4437, 4472, 10805, 7861, 9237, 10138, 1320, 10062, 5739, 978, 2368, 9326, 3639, 3646, 5680, 3982, 6691, 4230, 140, 871, 6899, 8249, 3900, 5280, 10134, 9333, 10682, 9228, 1607, 8517, 6497, 4478, 1318, 3811, 101, 3414, 9768, 7575, 7711, 10810, 6895, 9749, 4455, 4198, 1078, 5414, 10060, 2523, 5917, 8354, 2374, 1094, 304, 10073, 6902, 6897, 31, 3890, 7549, 8730, 9658, 9682, 11325, 1832, 1255, 9721, 9683, 3652, 10362, 1499, 850, 4453, 795, 2372, 9601, 25, 6894, 5274, 7863, 9743, 10561, 1239, 4740, 9189, 4443, 864, 3858, 3974, 1057, 2173, 1076, 2143, 3966, 10409, 8728, 5820, 5004, 5701, 8446, 4302, 8743, 4252, 9338, 4429, 8453, 3991, 8402, 1918, 3785, 7230, 1924, 10410, 10023, 9273, 7439, 118, 4411, 6089, 3638, 1245, 148, 3405, 5607, 9378, 4424, 3448, 6626, 7976, 4844, 8, 4080, 966, 8713, 6780, 752, 1316, 8447, 954, 8753, 1772, 5068, 5689, 5683, 214, 5686, 8438, 10539, 10827, 8656, 9661, 2307, 10948, 29, 4419, 2580, 10365, 111, 5642, 106, 116, 3393, 5383, 9195, 3385, 9669, 8854, 7974, 8992, 4498, 9292, 126, 2909, 4434, 9736, 1074, 956, 9390, 4426, 1609, 2577, 7229, 861, 8657, 2311, 9771, 3230, 5906, 964, 6242, 9379, 9229, 7548, 3653, 8941, 6149, 8439, 121, 2847, 3633, 9595, 3898, 9770, 3921, 10276, 10548, 7843, 9660, 5549, 8522, 3415, 5010, 17, 11217, 3877, 10565, 3003, 9707, 3946, 7004, 120, 3792, 8653, 10055, 10353, 7571, 1312, 7438, 8047, 1322, 208, 3396, 3647, 7980, 124, 5704, 3978, 92, 1634, 7032, 9934, 1604, 9774, 3862, 5955, 5618, 9933, 4236, 6777, 10369, 2687, 5675, 5750, 4448, 4082, 8082, 5388, 3860, 5688, 9702, 3960, 5916, 1288, 4489, 790, 808, 3797, 7545, 4335, 4470, 9285, 8052, 10806, 9744, 3631, 3866, 9665, 8520, 10376, 4492, 10357, 5677, 8041, 8250, 8985, 5922, 685, 4482, 8310, 9, 1229, 2907, 8715, 2040, 3539, 5069, 8370, 2536, 93, 5676, 4202, 6784, 6496, 10020, 2582, 1602, 2539, 8742, 3940, 8629, 7836, 8057, 11218, 3951, 10538, 1258, 1921, 10359, 10560, 2716, 1637, 6694, 3641, 6358, 2304, 5911, 862, 4481, 1047, 5415, 9667, 9277, 143, 2039, 10243, 1380, 5915, 6239, 5920, 7007, 7577, 2527, 10946, 3937, 8724, 4195, 4533, 3397, 980, 3386, 5071, 1920, 5744, 3943, 4496, 10025, 792, 5629, 7034, 8382, 5923, 3972, 9483, 8737, 9758, 10367, 8787, 9224, 4251, 11100, 9216, 3252, 7442, 5931, 1242, 4255, 3800, 856, 9240, 4415, 10677, 4527, 9481, 7324, 7862, 8851, 2041, 3913, 136, 7006, 5008, 8745, 2534, 3447, 8400, 5919, 8727, 1377, 6625, 553, 7441, 2846, 4329, 9367, 8982, 1630, 8361, 8343, 14, 1235, 10072, 3642, 10824, 8251, 5410, 4196, 9594, 2035, 10553, 7317, 6238, 9359, 8379, 2690, 3957, 9752, 4459, 6627, 1294, 10136, 983, 1306, 8940, 10021, 4445, 4846, 8246, 7712, 415, 9663, 5625, 8373, 2462, 3793, 3855, 3644, 1496, 2370, 1247, 9709, 10069, 2710, 3914, 7009, 4427, 7037, 9679, 8384, 9382, 8393, 145, 868, 7573, 7544, 10024, 8383, 8442, 1770, 10469, 2171, 8042, 6359, 5907, 8943, 865, 5641, 7325, 4617, 6357, 5822, 130, 8714, 1605, 3407, 2459, 1379, 8308, 4243, 8707, 2373, 3451, 10801, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'v', 'a', 'l', 146, 8345, 1044, 1253, 5818, 3856, 9727, 8988, 7003, 8852, 10803, 10404, 3783, 10542, 3802, 10829, 10675, 24, 796, 6632, 7030, 9750, 4308, 7576, 5670, 10788, 846, 6355, 10269, 10534, 7002, 104, 5816, 3881, 9932, 1315, 3919, 8389, 4460, 3634, 3768, 1293, 129, 9059, 3659, 3002, 8312, 9282, 5619, 8710, 4416, 1062, 8440, 30, 9659, 968, 6631, 5390, 2850, 1090, 10533, 3770, 4621, 4738, 8756, 9235, 8722, 7164, 2465, 32, 3988, 8353, 9782, 10832, 848, 1827, 7706, 5275, 9728, 7845, 7854, 3411, 8366, 9242, 10830, 8749, 5705, 6151, 9222, 2912, 3767, 7435, 6462, 7169, 3251, 4618, 3915, 6084, 9722, 4249, 9765, 8853, 10828, 8359, 10473, 3763, 8315, 8344, 122, 9664, 6152, 4457, 4620, 3891, 9363, 10135, 6489, 2371, 418, 3660, 8755, 4477, 417, 113, 4309, 3402, 5613, 10352, 6492, 1226, 9272, 4444, 5735, 6692, 8394, 10557, 3909, 1495, 9769, 524, 3870, 10059, 3222, 11329, 8706, 11011, 8649, 3889, 4622, 8368, 3645, 1046, 8996, 7852, 2175, 9479, 3852, 5382, 2457, 9872, 803, 110, 10550, 10807, 8452, 971, 8725, 1232, 8381, 9668, 3116, 1092, 3975, 10552, 8086, 10071, 4085, 4334, 554, 9387, 8937, 1381, 10141, 3969, 8704, 5925, 10782, 2712, 3392, 5631, 8046, 9296, 7775, 8650, 8087, 1384, 3958, 8747, 8376, 5685, 3640, 7233, 9735, 1228, 7708, 5746, 2686, 7542, 2150, 301, 7839, 4310, 1633, 8998, 6493, 2711, 149, 851, 3114, 8705, 125, 967, 99, 3257, 5937, 1497, 133, 3, 2845, 3907, 134, 1089, 9927, 9340, 3250, 4332, 6360, 5936, 8386, 4475, 4254, 1065, 9732, 753, 8374, 91, 9389, 2852, 1302, 8735, 127, 2148, 1317, 6244, 3935, 3844, 9221, 4, 2685, 119, 7841, 15, 4194, 3254, 3119, 9866, 1292, 10822, 128, 2849, 3903, 1256, 10789, 7031, 10834, 1091, 1252, 5921, 9775, 8040, 5165, 7856, 3871, 4238, 9931, 1298, 9271, 5385, 866, 9325, 8731, 6240, 3452, 1500, 9388, 3963, 9672, 2526, 5070, 3983, 9334, 4083, 2309, 5698, 7837, 8521, 139, 3851, 3985, 11220, 9746, 8458, 4845, 3416, 3122, 9742, 4532, 9747, 9867, 10786, 7975, 3956, 5281, 3953, 3883, 3765, 6778, 1494, 3892, 9710, 860, 8721, 9238, 3403, 9704, 5702, 690, 5954, 10674, 3798, 7569, 4847, 3417, 3845, 8740, 11015, 3227, 1077, 6090, 686, 8736, 4330, 8792, 838, 6779, 6091, 5754, 3662, 3885, 3226, 9217, 3225, 5694, 1766, 9773, 8090, 4333, 5282, 4435, 4410, 2520, 3384, 9270, 1305, 3916, 5756, 3629, 3863, 6494, 8516, 8977, 9869, 9366, 8390, 2545, 7543, 9383, 9871, 8726, 1240, 8445, 4431, 691, 305, 9197, 5682, 10022, 9358, 4425, 9780, 9337, 10405, 9286, 5409, 8387, 4241, 18, 5637, 10835, 1095, 10543, 3926, 16, 5157, 8433, 3932, 11215, 5620, 9779, 10833, 3987, 6362, 8455, 5934, 8997, 8245, 3795, 9778, 3848, 5929, 5612, 11322, 550, 5413, 3228, 3810, 9764, 7035, 7850, 8625, 5608, 1244, 3766, 10366, 9287, 4248, 3537, 22, 958, 2709, 4438, 3964, 688, 10537, 5741, 9369, 963, 3406, 7165, 8397, 5951, 4452, 10063, 2170, 1835, 10819, 1051, 1224, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'p', 'o', 'c', 'h', ' ', 'n', 'o', '.', '0'] [752, 936, 788, 600, 327, 923, 937, 123, 3, 342, 501, 899, 0, 3, 3, 1, 0, 0, 1, 0, 3, 0, 0, 1, 3, 3, 1, 0, 1, 0, 0, 0, 3, 1, 1, 0, 0, 0, 0, 1, 0, 1, 3, 1, 1, 0, 0, 3, 0, 3, 1, 0, 3, 0, 3, 0, 3, 0, 0, 976, 0, 0, 976, 3, 0, 3, 3, 3, 0, 0, 0, 0, 3, 0, 3, 0, 533, 0, 3, 0, 3, 0, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 1, 1, 0, 0, 3, 0, 0, 3, 0, 3, 3, 0, 0, 1, 0, 0, 0, 0, 0, 3, 3, 0, 0, 3, 0, 0, 0, 0, 3, 3, 3, 0, 3, 3, 976, 0, 1, 1, 3, 1, 0, 0, 3, 0, 0, 3, 3, 3, 0, 0, 0, 0, 0, 3, 3, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 0, 3, 0, 3, 3, 0, 0, 0, 3, 976, 0, 3, 3, 0, 0, 0, 977, 3, 0, 3, 0, 0, 0, 533, 3, 0, 3, 0, 0, 0, 3, 0, 3, 3, 533, 3, 0, 0, 0, 533, 0, 0, 0, 3, 3, 0, 0, 3, 1, 3, 0, 0, 533, 0, 3, 0, 3, 533, 3, 533, 0, 0, 3, 0, 0, 0, 3, 3, 533, 0, 0, 0, 3, 3, 0, 0, 0, 533, 0, 533, 3, 3, 0, 0, 0, 3, 3, 0, 3, 533, 3, 0, 0, 0, 3, 3, 0, 3, 533, 0, 0, 3, 533, 0, 0, 533, 0, 3, 3, 3, 0, 3, 0, 0, 3, 0, 3, 0, 0, 3, 0, 0, 533, 0, 3, 3, 3, 0, 0, 0, 0, 3, 0, 3, 3, 3, 0, 0, 3, 3, 0, 0, 3, 0, 3, 0, 3, 3, 533, 0, 3, 3, 0, 0, 3, 0, 3, 533, 3, 0, 3, 0, 0, 3, 0, 0, 3, 0, 3, 0, 0, 3, 3, 0, 3, 0, 976, 3, 3, 3, 0, 3, 0, 533, 3, 0, 3, 0, 533, 533, 0, 3, 3, 0, 0, 3, 3, 0, 0, 533, 0, 0, 533, 0, 3, 533, 0, 0, 0, 3, 0, 0, 3, 3, 3, 0, 3, 0, 0, 0, 0, 3, 3, 533, 3, 3, 0, 3, 0, 0, 3, 3, 3, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 3, 533, 0, 3, 3, 3, 0, 0, 3, 0, 0, 3, 0, 3, 0, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 3, 3, 0, 3, 0, 3, 3, 0, 0, 0, 3, 3, 0, 3, 3, 3, 0, 0, 3, 0, 3, 0, 3, 0, 0, 0, 0, 0, 3, 0, 0, 976, 3, 0, 0, 3, 3, 0, 976, 0, 0, 3, 3, 0, 0, 0, 3, 0, 0, 3, 1, 533, 3, 3, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 3, 0, 3, 0, 3, 0, 0, 0, 0, 3, 0, 533, 0, 0, 3, 1, 3, 1, 0, 0, 0, 3, 0, 0, 0, 3, 0, 533, 0, 0, 0, 3, 0, 3, 0, 0, 3, 0, 0, 3, 3, 0, 0, 0, 3, 3, 0, 3, 3, 0, 0, 0, 0, 1, 0, 0, 3, 0, 3, 1, 0, 0, 3, 0, 3, 0, 3, 0, 0, 1, 0, 0, 0, 0, 0, 3, 3, 0, 0, 0, 3, 3, 3, 3, 0, 3, 0, 3, 0, 0, 0, 0, 3, 3, 1, 0, 0, 3, 3, 0, 0, 3, 0, 0, 0, 3, 3, 3, 3, 0, 0, 3, 1, 3, 0, 3, 3, 0, 0, 0, 3, 0, 3, 1, 0, 1, 0, 1, 0, 3, 3, 1, 0, 0, 0, 3, 0, 3, 0, 3, 0, 3, 0, 0, 0, 3, 0, 1, 3, 0, 1, 1, 0, 3, 3, 0, 3, 1, 0, 1, 1, 3, 3, 3, 0, 0, 0, 3, 0, 3, 3, 1, 0, 3, 0, 0, 1, 3, 1, 0, 1, 3, 0, 3, 0, 3, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 0, 1, 1, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 3, 1, 1, 0, 0, 3, 3, 3, 0, 0, 1, 0, 0, 3, 0, 3, 0, 1, 3, 0, 0, 0, 0, 0, 0, 1, 0, 3, 0, 3, 0, 1, 0, 1, 0, 3, 3, 1, 1, 0, 1, 0, 0, 0, 3, 0, 1, 0, 3, 0, 0, 3, 0, 3, 0, 3, 0, 3, 0, 0, 0, 1, 0, 0, 0, 3, 0, 3, 0, 0, 1, 3, 1, 1, 0, 3, 0, 3, 0, 0, 3, 0, 1, 3, 0, 1, 3, 3, 0, 0, 0, 1, 1, 3, 3, 0, 0, 0, 1, 0, 3, 3, 0, 0, 1, 0, 3, 0, 3, 1, 3, 0, 3, 0, 0, 1, 0, 3, 0, 0, 0, 3, 3, 1, 0, 3, 0, 1, 0, 3, 3, 0, 0, 0, 0, 3, 0, 0, 3, 0, 0, 1, 0, 1, 0, 0, 3, 0, 3, 0, 0, 3, 0, 3, 1, 0, 0, 1, 0, 0, 3, 3, 3, 0, 0, 0, 3, 0, 0, 0, 3, 1, 3, 1, 1, 0, 3, 3, 0, 0, 0, 0, 1, 0, 0, 3, 1, 0, 3, 3, 0, 3, 1, 0, 1, 3, 0, 0, 0, 0, 0, 1, 3, 0, 0, 0, 3, 0, 3, 0, 0, 0, 1, 3, 0, 3, 0, 0, 3, 0, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 3, 0, 3, 3, 0, 0, 3, 0, 0, 3, 0, 3, 0, 0, 0, 0, 0, 3, 3, 1, 0, 3, 0, 0, 0, 3, 0, 3, 3, 0, 0, 1, 0, 3, 0, 0, 3, 0, 0, 3, 3, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 3, 0, 1, 0, 3, 0, 0, 3, 0, 1, 1, 0, 0, 0, 0, 0, 1, 3, 0, 3, 0, 0, 1, 1, 0, 0, 3, 3, 0, 0, 0, 3, 0, 0, 1, 0, 0, 0, 0, 3, 1, 0, 0, 0, 3, 3, 3, 3, 0, 0, 0, 0, 0, 3, 0, 3, 1, 0, 0, 3, 1, 3, 0, 0, 3, 3, 1, 0, 0, 3, 0, 0, 1, 3, 0, 3, 3, 0, 3, 0, 0, 0, 0, 0, 1, 3, 0, 3, 0, 0, 3, 0, 0, 3, 0, 0, 0, 0, 3, 1, 0, 0, 0, 1, 3, 3, 0, 3, 1, 1, 3, 0, 0, 0, 3, 0, 0, 0, 0, 1, 0, 3, 3, 0, 0, 0, 0, 3, 0, 3, 3, 3, 0, 0, 1, 0, 0, 1, 0, 3, 0, 3, 0, 1, 3, 0, 0, 3, 0, 0, 3, 0, 0, 3, 0, 0, 0, 0, 0, 3, 3, 0, 0, 3, 0, 0, 3, 3, 0, 0, 0, 0, 3, 0, 0, 0, 1, 0, 1, 0, 3, 3, 0, 0, 1, 0, 3, 0, 3, 1, 0, 0, 0, 1, 0, 3, 3, 3, 0, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 3, 3, 0, 0, 0, 0, 0, 3, 0, 1, 3, 3, 0, 1, 0, 0, 3, 1, 3, 3, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 3, 0, 1, 0, 0, 3, 0, 0, 0, 1, 3, 1, 3, 1, 1, 0, 0, 3, 0, 0, 0, 0, 0, 3, 0, 3, 1, 0, 0, 1, 0, 0, 3, 0, 0, 0, 3, 1, 0, 1, 1, 3, 0, 0, 0, 0, 1, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0, 1, 0, 0, 1, 0, 0, 3, 3, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 3, 0, 3, 0, 1, 0, 0, 1, 0, 1, 0, 3, 0, 3, 0, 1, 0, 1, 0, 0, 3, 0, 3, 0, 1, 0, 3, 0, 0, 1, 0, 0, 0, 3, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 3, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 3, 3, 0, 1, 0, 0, 0, 0, 3, 0, 1, 3, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'v', 'a', 'l', 1, 3, 3, 3, 0, 0, 1, 3, 0, 0, 3, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 0, 1, 0, 0, 0, 0, 0, 3, 0, 3, 0, 3, 0, 3, 3, 0, 1, 3, 0, 0, 3, 1, 0, 0, 0, 0, 0, 3, 3, 0, 3, 0, 3, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 3, 3, 1, 0, 0, 0, 1, 1, 3, 3, 3, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0, 0, 3, 1, 3, 0, 3, 0, 0, 3, 1, 3, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 3, 1, 3, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 3, 3, 3, 3, 0, 3, 3, 1, 0, 1, 0, 3, 1, 3, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 3, 3, 3, 1, 3, 0, 3, 3, 0, 0, 3, 3, 0, 3, 0, 0, 0, 0, 1, 0, 0, 3, 3, 0, 3, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 3, 0, 0, 1, 1, 0, 3, 3, 0, 1, 0, 0, 0, 3, 1, 0, 3, 3, 0, 0, 1, 0, 0, 0, 0, 3, 3, 0, 0, 0, 0, 0, 3, 0, 0, 3, 0, 3, 0, 3, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0, 3, 3, 0, 0, 0, 0, 3, 0, 3, 3, 3, 3, 3, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 3, 3, 3, 3, 0, 3, 0, 0, 3, 3, 0, 3, 0, 0, 0, 0, 3, 1, 0, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 3, 0, 0, 0, 3, 3, 0, 1, 0, 3, 3, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 3, 3, 3, 0, 3, 0, 0, 0, 1, 3, 3, 0, 0, 0, 0, 3, 0, 0, 0, 1, 0, 1, 0, 0, 0, 3, 0, 3, 0, 3, 1, 0, 0, 3, 0, 3, 0, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 0, 3, 1, 0, 0, 0, 1, 0, 0, 0, 3, 3, 0, 3, 0, 0, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 3, 0, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'p', 'o', 'c', 'h', ' ', 'n', 'o', '.', '0'] [3, 0, 0, 3, 1, 1, 0, 1, 1, 0, 1, 1, 3, 1, 3, 1, 0, 0, 3, 0, 0, 0, 0, 1, 3, 3, 1, 0, 0, 0, 3, 0, 3, 1, 0, 0, 0, 1, 0, 1, 3, 0, 3, 0, 1, 0, 0, 3, 0, 0, 0, 0, 1, 1, 1, 0, 3, 0, 0, 3, 0, 0, 1, 3, 1, 3, 3, 0, 0, 0, 1, 1, 1, 3, 1, 0, 1, 0, 3, 0, 3, 0, 1, 3, 0, 3, 3, 3, 3, 3, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 3, 0, 1, 3, 1, 0, 1, 1, 3, 0, 1, 3, 0, 3, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 3, 1, 0, 0, 0, 1, 0, 1, 3, 0, 3, 0, 0, 1, 1, 0, 3, 3, 0, 0, 0, 0, 0, 3, 1, 1, 0, 1, 0, 3, 0, 1, 3, 1, 3, 0, 1, 3, 0, 1, 3, 1, 3, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 3, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 3, 1, 0, 0, 3, 0, 1, 3, 1, 1, 1, 0, 0, 0, 0, 3, 3, 1, 3, 0, 3, 1, 3, 0, 0, 1, 0, 3, 0, 1, 1, 1, 3, 0, 1, 0, 3, 0, 0, 3, 0, 1, 3, 1, 0, 3, 0, 0, 3, 0, 0, 0, 0, 1, 3, 0, 1, 0, 1, 3, 1, 3, 1, 0, 0, 1, 3, 1, 3, 1, 0, 3, 0, 0, 0, 1, 0, 0, 0, 3, 1, 0, 0, 0, 0, 0, 1, 1, 1, 3, 0, 0, 0, 0, 1, 3, 3, 3, 3, 0, 1, 3, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 3, 1, 1, 1, 0, 3, 1, 0, 0, 0, 0, 3, 3, 0, 0, 0, 0, 3, 0, 1, 0, 1, 0, 0, 3, 0, 3, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 3, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 3, 3, 0, 3, 1, 0, 3, 1, 3, 0, 3, 0, 0, 3, 3, 0, 0, 1, 3, 1, 0, 0, 3, 0, 0, 3, 0, 1, 1, 3, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 3, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 3, 1, 3, 1, 0, 0, 1, 0, 0, 1, 0, 3, 3, 0, 3, 0, 1, 0, 3, 0, 1, 0, 1, 0, 3, 0, 1, 0, 3, 3, 1, 1, 0, 3, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 3, 3, 0, 3, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 1, 0, 3, 0, 1, 1, 0, 0, 0, 1, 0, 3, 1, 0, 3, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 3, 0, 1, 1, 3, 0, 0, 1, 3, 0, 3, 1, 3, 3, 1, 0, 0, 0, 0, 0, 3, 3, 0, 1, 1, 1, 1, 1, 0, 3, 0, 3, 0, 0, 0, 3, 1, 0, 0, 0, 3, 0, 1, 1, 3, 0, 0, 0, 0, 1, 3, 1, 0, 1, 1, 0, 0, 0, 3, 0, 1, 1, 1, 1, 3, 3, 1, 0, 0, 1, 0, 0, 1, 0, 1, 3, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 3, 0, 0, 0, 0, 1, 1, 0, 3, 1, 0, 1, 1, 0, 0, 3, 3, 3, 1, 1, 1, 3, 0, 0, 1, 1, 0, 3, 0, 0, 1, 1, 0, 1, 3, 0, 3, 3, 1, 0, 3, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 3, 0, 1, 1, 1, 3, 0, 3, 0, 0, 0, 1, 1, 1, 1, 0, 1, 3, 1, 1, 3, 0, 1, 1, 1, 0, 0, 3, 3, 3, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 3, 0, 1, 0, 3, 0, 0, 3, 0, 0, 3, 0, 0, 0, 1, 3, 0, 3, 0, 3, 1, 3, 1, 0, 3, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 3, 0, 0, 0, 1, 3, 3, 0, 3, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 1, 0, 3, 0, 0, 3, 0, 3, 0, 1, 3, 0, 0, 0, 3, 1, 0, 0, 0, 0, 3, 0, 3, 1, 1, 0, 0, 0, 0, 3, 0, 0, 0, 1, 0, 1, 3, 0, 0, 3, 0, 0, 1, 3, 3, 0, 0, 1, 1, 3, 3, 0, 0, 0, 0, 1, 0, 0, 0, 3, 3, 0, 3, 1, 0, 3, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 3, 0, 0, 0, 3, 1, 0, 3, 1, 1, 3, 0, 3, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 3, 0, 1, 3, 0, 0, 3, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 3, 0, 3, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 3, 3, 0, 1, 1, 1, 0, 3, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 3, 0, 1, 3, 0, 0, 0, 3, 1, 3, 3, 0, 3, 0, 0, 0, 0, 0, 1, 1, 0, 0, 3, 0, 3, 0, 0, 1, 1, 1, 3, 1, 3, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 3, 0, 3, 0, 0, 1, 1, 0, 0, 3, 1, 3, 1, 0, 1, 3, 3, 3, 0, 1, 0, 1, 1, 3, 0, 1, 3, 3, 0, 0, 1, 0, 0, 1, 0, 1, 3, 0, 1, 0, 0, 0, 1, 1, 3, 0, 1, 1, 0, 1, 0, 0, 1, 0, 3, 1, 1, 0, 0, 0, 0, 3, 0, 0, 0, 0, 3, 3, 1, 0, 3, 0, 0, 0, 3, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 3, 1, 0, 3, 3, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 3, 3, 0, 1, 1, 0, 1, 3, 0, 1, 0, 3, 0, 0, 0, 0, 1, 3, 1, 0, 1, 1, 3, 0, 0, 0, 3, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 3, 1, 0, 0, 3, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 3, 0, 3, 3, 0, 0, 1, 1, 0, 1, 1, 3, 3, 3, 3, 3, 1, 0, 0, 1, 0, 3, 3, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 3, 1, 1, 0, 3, 0, 0, 3, 0, 1, 3, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 3, 0, 1, 3, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 3, 3, 1, 3, 1, 0, 1, 1, 0, 3, 0, 0, 3, 1, 3, 1, 3, 0, 1, 0, 0, 1, 0, 3, 0, 3, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 3, 3, 1, 1, 1, 1, 3, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 3, 0, 1, 1, 1, 1, 0, 0, 1, 0, 3, 0, 0, 3, 3, 3, 0, 1, 0, 1, 1, 3, 1, 1, 0, 1, 1, 3, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 3, 1, 1, 3, 3, 1, 1, 1, 1, 3, 1, 0, 3, 0, 1, 3, 0, 1, 1, 1, 0, 1, 1, 3, 0, 1, 1, 3, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 3, 3, 0, 3, 0, 3, 0, 1, 0, 3, 1, 1, 3, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 3, 0, 1, 0, 0, 0, 3, 3, 1, 1, 3, 1, 0, 0, 0, 0, 3, 3, 0, 1, 0, 1, 3, 3, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 3, 3, 0, 0, 3, 3, 3, 1, 3, 0, 1, 3, 1, 0, 0, 1, 0, 0, 0, 3, 0, 3, 0, 0, 3, 1, 1, 1, 1, 0, 1, 0, 1, 0, 3, 0, 0, 0, 1, 0, 1, 1, 3, 3, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 3, 0, 1, 3, 0, 3, 0, 1, 3, 0, 0, 0, 0, 1, 0, 3, 3, 0, 0, 3, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 3, 0, 3, 0, 0, 1, 3, 0, 3, 1, 1, 1, 1, 3, 0, 0, 0, 3, 0, 0, 1, 3, 1, 1, 0, 3, 0, 1, 0, 0, 3, 0, 0, 0, 1, 0, 0, 1, 0, 3, 3, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 3, 3, 0, 0, 3, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 3, 0, 3, 0, 3, 3, 0, 3, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 3, 0, 1, 1, 3, 0, 0, 0, 1, 1, 0, 1, 3, 0, 3, 1, 1, 0, 0, 0, 0, 1, 3, 3, 3, 1, 1, 3, 0, 3, 3, 3, 1, 3, 0, 1, 0, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 3, 3, 1, 1, 0, 0, 0, 0, 0, 0, 3, 1, 1, 0, 3, 3, 0, 1, 1, 3, 0, 3, 0, 0, 0, 0, 1, 0, 0, 3, 1, 3, 1, 0, 3, 1, 1, 0, 0, 0, 3, 0, 3, 0, 0, 3, 0, 1, 3, 0, 0, 3, 3, 0, 0, 0, 1, 1, 3, 0, 1, 1, 0, 3, 0, 1, 0, 1, 1, 3, 0, 1, 1, 0, 1, 0, 0, 3, 3, 1, 1, 1, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 3, 0, 0, 3, 3, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 3, 1, 1, 3, 0, 0, 0, 0, 0, 1, 0, 0, 3, 3, 0, 1, 3, 3, 0, 0, 0, 3, 3, 0, 0, 3, 0, 0, 0, 0, 3, 1, 3, 0, 0, 1, 1, 0, 0, 3, 0, 1, 0, 1, 0, 3, 0, 3, 3, 1, 3, 0, 1, 0, 0, 0, 3, 1, 0, 0, 0, 3, 0, 3, 0, 1, 1, 0, 0, 0, 0, 1, 3, 0, 3, 0, 0, 0, 1, 3, 0, 0, 3, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'v', 'a', 'l', 0, 1, 1, 3, 0, 1, 3, 1, 0, 0, 3, 0, 1, 1, 1, 3, 0, 1, 1, 0, 0, 3, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 3, 1, 3, 3, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 3, 3, 0, 1, 1, 3, 3, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 3, 0, 0, 1, 0, 1, 1, 3, 1, 0, 0, 0, 3, 3, 3, 3, 1, 1, 3, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 3, 1, 1, 0, 3, 1, 0, 0, 0, 1, 1, 3, 0, 3, 0, 1, 1, 0, 0, 0, 0, 0, 1, 3, 0, 1, 0, 3, 0, 3, 0, 0, 1, 3, 1, 0, 3, 0, 1, 0, 1, 0, 1, 1, 0, 0, 3, 0, 0, 1, 0, 1, 1, 1, 1, 3, 0, 0, 1, 0, 0, 0, 1, 1, 1, 3, 1, 3, 3, 0, 3, 3, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 0, 0, 0, 1, 3, 1, 0, 0, 0, 0, 1, 1, 3, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 0, 0, 1, 0, 0, 0, 1, 0, 3, 1, 3, 1, 0, 3, 0, 1, 1, 0, 1, 1, 0, 0, 3, 0, 0, 0, 3, 3, 3, 1, 0, 0, 0, 3, 1, 0, 0, 3, 1, 1, 0, 3, 0, 1, 1, 1, 1, 0, 1, 3, 0, 0, 0, 0, 0, 0, 3, 1, 0, 1, 3, 0, 0, 3, 0, 3, 3, 1, 3, 0, 3, 1, 1, 0, 3, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 3, 3, 0, 1, 3, 0, 0, 0, 3, 0, 1, 1, 1, 0, 3, 1, 0, 3, 0, 3, 0, 3, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 3, 1, 3, 0, 0, 0, 0, 0, 1, 0, 0, 3, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 3, 3, 3, 0, 1, 3, 1, 1, 1, 1, 0, 0, 1, 0, 1, 3, 3, 0, 1, 0, 3, 3, 1, 3, 0, 0, 0, 1, 0, 3, 3, 1, 3, 0, 1, 0, 3, 1, 1, 1, 3, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 3, 0, 0, 1, 3, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 3, 0, 0, 3, 0, 3, 1, 1, 0, 1, 0, 0, 3, 1, 0, 1, 1, 1, 3, 3, 0, 0, 0, 3, 1, 0, 0, 3, 1, 0, 'f', 'r', 'o', 'm', ' ', 'h', 'e', 'r', 'e', ' ', 's', 't', 'a', 'r', 't', ' ', 'e', 'p', 'o', 'c', 'h', ' ', 'n', 'o', '.', '0']
Epoch: 2/40
